run/DA0120/constant/polyMesh/boundary
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  5.x                                   |
|   \\  /    A nd           | Web:      www.OpenFOAM.org                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       polyBoundaryMesh;
    location    "constant/polyMesh";
    object      boundary;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

6
(
    frontField
    {
        type            patch;
        nFaces          620;
        startFace       107920;
    }
    backField
    {
        type            patch;
        nFaces          620;
        startFace       108540;
    }
    symPlane
    {
        type            symmetryPlane;
        inGroups        1(symmetryPlane);
        nFaces          1860;
        startFace       109160;
    }
    sideField
    {
        type            patch;
        nFaces          1860;
        startFace       111020;
    }
    ground
    {
        type            wall;
        inGroups        1(wall);
        nFaces          1200;
        startFace       112880;
    }
    top
    {
        type            patch;
        nFaces          1200;
        startFace       114080;
    }
)

// ************************************************************************* //
