run/DA0120/constant/reactions
species
(
    air
    SF6 
);

reactions
{}

